/*************************************************************************
	> File Name: test77.cpp
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月09日 星期四 23时18分52秒
 ************************************************************************/

/*************************************************************************
 * 我国大陆运营商的手机号码标准格式为：国家码+手机号码，例如：8613912345678。特点如下：
 * 1、  长度13位；
 * 2、  以86的国家码打头；
 * 3、  手机号码的每一位都是数字。
 *
 * 请实现手机号码合法性判断的函数要求：
 * 1）  如果手机号码合法，返回0；
 * 2）  如果手机号码长度不合法，返回1
 * 3）  如果手机号码中包含非数字的字符，返回2；
 * 4）  如果手机号码不是以86打头的，返回3；
 * 【注】除成功的情况外，以上其他合法性判断的优先级依次降低。也就是说，如果判断出长度不合法，直接返回1即可，不需要再做其他合法性判断。
 * 示例
 * 输入：  inMsisdn = “869123456789“
 * 输出：   1
 * 输入：  inMsisdn = “88139123456789“
 * 输出：   3
 * 输入：  inMsisdn = “86139123456789“
 * 输出：   0
 * ********************************************************************/
#include<iostream>
#include<string>
#include<cctype>

int Judge(const std::string &str)
{
	if(str.size() != 13) 
		return 1;
	for(size_t i = 0; i < 13; ++i) {
		if(!isdigit(str[i]))
			return 2;
	}
	if(str[0] != '8' || str[1] != '6')
		return 3;
	return 0;
}
int main(void)
{
	std::string number;
	std::cin >> number;

	std::cout << Judge(number) <<std::endl;
	return 0;
}
