/*************************************************************************
	> File Name: test74.cpp
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月09日 星期四 21时03分09秒
 ************************************************************************/

/*******************************************************************
 * 自从有了智能手机，时刻都要关心手机的电量。你的任务很简单，用程序打印符号来表示当前手机的电量。
 * 用10行和10列来表示电池的电量，同时在外围加上边框，每一行表示10%的电量。
 * 假设还有60%的电量，则显示如下：
 * +----------+
 * |----------|
 * |----------|
 * |----------|
 * |----------|
 * |++++++++++|
 * |++++++++++|
 * |++++++++++|
 * |++++++++++|
 * |++++++++++|
 * |++++++++++|
 * +----------+
 * 运行时间限制: 无限制 
 * 内存限制: 无限制 
 * 输入: 多组测试数据，第一行为测试数据组数N（N<10），紧接着是N行，每行一个数，表示电量，这个数值可能是0，10，20 ，30，40，50，60，70，80，90，100
 * 输出: 每组数据输出一个电池的电量，每组数据之间用15个“=”隔开
 * ***************************************************************/
#include<iostream>
#include<string>
#include<vector>

void Print(const std::vector<std::string> &svec) 
{
	for(size_t i = 0; i < svec.size(); ++i) {
		std::cout << svec[i] << std::endl;
	}
}

void foo(int num)
{
	if(num > 100 || num < 0) return;

	std::vector<std::string> svec(12, "+----------+");
	size_t i = 1;

	for(i = 1; i != 11; ++i) {
		svec[i][0] = '|';
		svec[i][11] = '|';
	}
	int deadline(100 - num);
	int index(0);
	for(i = 1; i != 11; ++i) {
		for(size_t j = 1; j != 11; ++j) {
			if(index >= deadline)
				svec[i][j] = '+';
			++index;
		}
	}
	Print(svec);
}
int main(void)
{
	int num;
	while(std::cin >> num) {
		foo(num);
	}
	return 0;
}
