/*************************************************************************
	> File Name: test22.c
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月02日 星期四 20时56分07秒
 ************************************************************************/

/*************************************************************
 * 输入一组身高在170到190之间（5个身高）比较身高，选出身高差最小的两个身高；若身高差相同，选平均身高高的那两个身高；从小到大输出；
 * 如：输入 170 181 173 186 190   输出 170 173
 * *********************************************************/
#include<stdio.h>
#include<algorithm>

int main(void)
{
	int min = 99;
	int H1 = 0, H2 = 0;
	int array[5] = {0};

	int i = 0, j = 0;
	for(i = 0; i < 5; ++i)
		scanf("%d", &array[i]);

	std::sort(array, array+5);

	for(i = 0; i < 4; ++i) {
		for(j = i+1; j < 5; ++j) {
			if(array[j] - array[i] <= min) {
				min = array[j] - array[j];
				H1 = array[i];
				H2 = array[j];
			}
		}
	}

	printf("%d %d\n",H1, H2);

	return 0;
}
