/*************************************************************************
	> File Name: test49.cpp
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月05日 星期日 23时15分55秒
 ************************************************************************/

/***********************************************
 * 输入一个10进制数字，请计算该数字对应二进制中0的个数，
 * 注意左数第一个1之前的所有0都不需要计算。不需要考虑负数的情况。
 * ********************************************/
#include<iostream>
using namespace std;

int main(void)
{
	int m;
	std::cin >> m;
	unsigned int i = 0x1;

	int count = 0;

	while(i != 0 && (m & i) == 0) {
		count++;
		i = i << 1;
	}

	std::cout << count << std::endl;

	return 0;
}
