/*************************************************************************
	> File Name: test80.cpp
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月11日 星期六 21时27分58秒
 ************************************************************************/

/******************************************************************
 * 建立一个二叉树，求其高度，首先前、中、后序遍历，
 * 求叶子数，求数的深度并且判断是否为平衡二叉树。
 * *****************************************************************/
#include<iostream>
#include<vector>

struct _Node {
	int val;
	_Node *pLeft;
	_Node *pRight;
};



