/*************************************************************************
	> File Name: test.c
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月24日 星期五 16时30分47秒
 ************************************************************************/

/******************************************************************
 * 网易的笔试题一道:
 *  
 *  如图：
 *   7	8	9	10
 *   6	1	2	11
 *	 5	4	3	12
 *	 16	15	14	13
 *
 *    设“1”的坐标为（0，0） “7”的坐标为（－1，－1） 
 *    编写一个小程序，使程序做到输入坐标（X,Y）之后显示出相应的数字。
 * ***************************************************************/
#include<iostream>
#include<cstdio>
#include<vector>
#include<string>
#define BIA_X -1
#define BIA_Y -1

int array[4][4] =  {{7, 8, 9, 10},
					{6, 1, 2, 11},
					{5, 4, 3, 12},
					{16,15,14,13}};

int foo(int x, int y);
int main(void){
	for(int i = -1; i < 3; ++i) {
		for(int j = -1; j < 3; ++j) {
			printf("(%d,%d) is %d\n",i, j, foo(i, j));
		}
//		printf("\n");
	}
}

int foo(int x, int y) {
	x = x - BIA_X;
	y = y - BIA_Y;
	return array[y][x];
}

