/*************************************************************************
	> File Name: test14.c
	> Author: leon
	> Mail: sjzlyl406@163.com 
	> Created Time: 2015年07月01日 星期三 10时09分24秒
 ************************************************************************/

/*****************************************************************
 * 写一个函数， 求两个整数之和，要求在函数体内不得使用
 * +、-、*、/四则运算符号。
 * ***************************************************************/
#include<stdio.h>

int Sum(int num1, int num2)
{
	int sum, carry;
	while(num2 != 0 ) {
		sum = num1 ^ num2;
		carry = (num1 & num2) << 1;

		num1 = sum;
		num2 = carry;
	}
	return num1;
}
int main(void)
{
	int m1 , m2;
	scanf("%d %d", &m1, &m2);

	printf("%d + %d = %d\n", m1, m2, Sum(m1,m2));

	return 0;
}



